engines = {
    "stock": "Фондовый рынок и рынок депозитов",
    "state": "Рынок ГЦБ (размещение)",
    "currency": "Валютный рынок",
    "futures": "Срочный рынок",
    "commodity": "Товарный рынок",
    "interventions": "Товарные интервенции",
    "offboard": "ОТС-система",
    "agro": "Агро",
    "otc": "OTC Система",
}
markets = {
    "stock": [
        {"index": "Индексы фондового рынка"},
        {"shares": "Рынок акций"},
        {"bonds": "Рынок облигаций"},
        {"ndm": "Режим переговорных сделок"},
        {"otc": "ОТС"},
        {"ccp": "РЕПО с ЦК"},
        {"deposit": "Депозиты с ЦК"},
        {"repo": "Рынок сделок РЕПО"},
        {"qnv": "Квал. инвесторы"},
        {"mamc": "Мультивалютный рынок смешанных активов"},
        {"foreignshares": "Иностранные ц.б."},
        {"foreignndm": "Иностранные ц.б. РПС"},
        {"moexboard": "MOEX Board"},
        {"gcc": "РЕПО с ЦК с КСУ"},
        {"credit": "Рынок кредитов"},
        {"nonresndm": "Режим переговорных сделок (нерезиденты)"},
        {"nonresrepo": "Рынок РЕПО (нерезиденты)"},
        {"nonresccp": "Рынок РЕПО с ЦК (нерезиденты)"},
        {"standard": "Standard"},
        {"classica": "Classica"}
    ],
    "state": [
        {"index": "Индексы ГКО\/ОФЗ"},
        {"bonds": "Облигации ГЦБ"},
        {"repo": "Междилерское РЕПО"},
        {"ndm": "Внесистемные сделки"}
    ],
    "currency": [
        {"selt": "Биржевые сделки с ЦК"},
        {"futures": "Поставочные фьючерсы"},
        {"index": "Валютный фиксинг"},
        {"otc": "Внебиржевой"}
    ],
    "futures": [
        {"main": "Срочные инструменты"},
        {"forts": "ФОРТС"},
        {"options": "Опционы ФОРТС"},
        {"fortsiqs": "Фьючерсы IQS"},
        {"optionsiqs": "Опционы IQS"}
    ],
    "commodity": [
        {"futures": "Секция стандартных контрактов АО НТБ"}
    ],
    "interventions": [
        {"grain": "Интервенции по зерну"}
    ],
    "offboard": [
        {"bonds": "Облигации"}
    ],
    "agro": [
        {"sugar": "Торги сахаром"},
        {"auctions": "Аукционы НТБ"},
        {"buyauctions": "Закупочные аукционы НТБ"}
    ],
    "otc": [
        {"bonds": "Облигации"},
        {"ndm": "Облигации c ЦК"}
    ]
}
